orgServer/app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."type" IN ('Manager') AND "employees"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def index
    @employees = Employee.all

SELECT  "employees".* FROM "employees" WHERE "employees"."type" IN ('Manager') AND "employees"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_employee
      @employee = Employee.find(params[:id])