orgServer/app/controllers/reports_controller.rb

  def create
    @report = Report.new(report_params)

    if @report.save
---
INSERT INTO "reports" ("text", "created_at", "updated_at", "manager_id", "employee") VALUES (?, ?, ?, ?, ?)  [["text", "ASSSSSSSSSSSSSSSSSSSSSSSSSS"], ["created_at", "2017-06-04 20:34:44.068386"], ["updated_at", "2017-06-04 20:34:44.068386"], ["manager_id", 9], ["employee", 7]]