orgServer/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("text", "due_date", "created_at", "updated_at", "employee_id", "manager_id") VALUES (?, ?, ?, ?, ?, ?)  [["text", "sfsaSfsF"], ["due_date", "2017-06-13 21:00:00"], ["created_at", "2017-06-04 22:17:37.229961"], ["updated_at", "2017-06-04 22:17:37.229961"], ["employee_id", 7], ["manager_id", 9]]
---
  def create
    @task = Task.new(task_params)

    if @task.save